In [1]:
#importing libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
#load dataset
Customer_Demographic=pd.read_excel("C:/Users/User/Downloads/KPMG_VI_New_raw_data_update_final.xlsx", sheet_name ='CustomerDemographic', header = 1)

C:\Users\User\AppData\Local\Temp\ipykernel_16832\955017759.py:2: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  Customer_Demographic=pd.read_excel("C:/Users/User/Downloads/KPMG_VI_New_raw_data_update_final.xlsx", sheet_name ='CustomerDemographic', header = 1)

In [3]:
Customer_Address =pd.read_excel("C:/Users/User/Downloads/KPMG_VI_New_raw_data_update_final.xlsx", sheet_name = 'CustomerAddress', header = 1)

In [4]:
Transaction_data=pd.read_excel("C:/Users/User/Downloads/KPMG_VI_New_raw_data_update_final.xlsx", sheet_name = 'Transactions', header = 1)

In [5]:
Customer_List =pd.read_excel("C:/Users/User/Downloads/KPMG_VI_New_raw_data_update_final.xlsx", sheet_name = 'NewCustomerList', header = 1)

C:\Users\User\AppData\Local\Temp\ipykernel_16832\674662113.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  Customer_List =pd.read_excel("C:/Users/User/Downloads/KPMG_VI_New_raw_data_update_final.xlsx", sheet_name = 'NewCustomerList', header = 1)

### 1. Customer_Demographic Dataset

In [6]:
Customer_Demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [7]:
Customer_Demographic.tail()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
3995,3996,Rosalia,Halgarth,Female,8,1975-08-09,VP Product Management,Health,Mass Customer,N,-100,No,19.0
3996,3997,Blanch,Nisuis,Female,87,2001-07-13,Statistician II,Manufacturing,High Net Worth,N,â¦testâ§,Yes,1.0
3997,3998,Sarene,Woolley,U,60,NaT,Assistant Manager,IT,High Net Worth,N,NaN,No,NaN
3998,3999,Patrizius,NaN,Male,11,1973-10-24,NaN,Manufacturing,Affluent Customer,N,Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ,Yes,10.0
3999,4000,Kippy,Oldland,Male,76,1991-11-05,Software Engineer IV,NaN,Affluent Customer,N,0/0,No,11.0

In [8]:
Customer_Demographic.shape

(4000, 13)

In [9]:
Customer_Demographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [10]:
Customer_Demographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [11]:
# Cleaning the gender column

In [12]:
Customer_Demographic['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [13]:
Customer_Demographic['gender']= Customer_Demographic['gender'].replace('F', 'Female')

In [14]:
Customer_Demographic['gender']= Customer_Demographic['gender'].replace('M', 'Male')

In [15]:
Customer_Demographic['gender']= Customer_Demographic['gender'].replace('Femal', 'Female')

In [16]:
Customer_Demographic['gender']= Customer_Demographic['gender'].replace('U', np.NaN)

In [17]:
Customer_Demographic['gender'].value_counts()

Female    2039
Male      1873
Name: gender, dtype: int64

In [18]:
#Feature Engineering- Creating a year column
Customer_Demographic['Birth_Year'] = pd.DatetimeIndex(Customer_Demographic['DOB']).year

In [19]:
Customer_Demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure,Birth_Year
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0,1953.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0,1980.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0,1954.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0,1961.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0,1977.0

In [20]:
Customer_Demographic['Birth_Year'].value_counts().sort_values()

1940.0      1
1843.0      1
1944.0      1
1943.0      1
1935.0      1
1931.0      1
2002.0      6
1953.0     19
2001.0     34
1983.0     40
1982.0     41
2000.0     42
1984.0     43
1991.0     48
1990.0     53
1972.0     54
1958.0     55
1970.0     57
1960.0     58
1955.0     58
1963.0     59
1993.0     60
1999.0     60
1961.0     60
1954.0     61
1956.0     63
1966.0     65
1996.0     67
1965.0     69
1968.0     69
1957.0     71
1987.0     72
1988.0     72
1967.0     73
1992.0     74
1989.0     74
1997.0     74
1962.0     76
1969.0     78
1994.0     79
1981.0     79
1998.0     80
1964.0     85
1971.0     88
1995.0     90
1985.0     91
1959.0     94
1975.0    114
1986.0    114
1979.0    118
1973.0    122
1980.0    123
1976.0    152
1974.0    152
1977.0    204
1978.0    217
Name: Birth_Year, dtype: int64

In [21]:
Customer_Demographic['job_title'].value_counts().sort_values()

Developer I                              1
Health Coach I                           3
Research Assistant III                   3
Health Coach III                         3
Database Administrator I                 4
                                        ..
Recruiting Manager                      41
Internal Auditor                        42
Social Worker                           44
Tax Accountant                          44
Business Systems Development Analyst    45
Name: job_title, Length: 195, dtype: int64

In [22]:
Customer_Demographic['wealth_segment'].value_counts().sort_values()

Affluent Customer     979
High Net Worth       1021
Mass Customer        2000
Name: wealth_segment, dtype: int64

In [23]:
Customer_Demographic['owns_car'].value_counts().sort_values()

No     1976
Yes    2024
Name: owns_car, dtype: int64

In [24]:
Customer_Demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure,Birth_Year
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0,1953.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0,1980.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0,1954.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0,1961.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0,1977.0

In [25]:
Customer_Demographic['job_industry_category'].value_counts().sort_values()

Telecommunications     72
Argiculture           113
Entertainment         136
IT                    223
Property              267
Retail                358
Health                602
Financial Services    774
Manufacturing         799
Name: job_industry_category, dtype: int64

In [26]:
Customer_Demographic['default'].value_counts()

100                                       113
1                                         112
-1                                        111
-100                                       99
Ù¡Ù¢Ù£                                     53
                                         ...
testâ testâ«                               31
/dev/null; touch /tmp/blns.fail ; echo     30
âªâªtestâª                                 29
ì¸ëë°í ë¥´                                 27
,ãã»:*:ã»ãâ( â» Ï â» )ãã»:*:ã»ãâ           25
Name: default, Length: 90, dtype: int64

In [27]:
Customer_Demographic['tenure'].value_counts().sort_values()

21.0     54
22.0     55
20.0     96
2.0     150
19.0    159
3.0     160
1.0     166
15.0    179
17.0    182
4.0     191
13.0    191
6.0     192
9.0     200
14.0    200
12.0    202
18.0    208
8.0     211
16.0    215
10.0    218
11.0    221
5.0     228
7.0     235
Name: tenure, dtype: int64

In [28]:
Customer_Demographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                  88
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
Birth_Year                              87
dtype: int64

### Missing Data

- Either drop the rows or replace the missing data with mean or mode

#### Columns with Missing data to work on 
* Gender replace with mode
* job_industry_category replace with mode
* tenure replace with mean
* Drop DOB

In [29]:
#Gender
Customer_Demographic['gender']= Customer_Demographic['gender'].replace(np.NaN, 'Female')

In [30]:
#job_industry_category
Customer_Demographic['job_industry_category']= Customer_Demographic['job_industry_category'].replace(np.NaN, 'Manufacturing')

In [31]:
tenure_mean = Customer_Demographic['tenure'].mean()
tenure_mean

10.65704063378482

In [32]:
Customer_Demographic['tenure']= Customer_Demographic['tenure'].replace(np.NaN, tenure_mean)

In [33]:
birth_common = Customer_Demographic['Birth_Year'].astype('float').mode()
birth_common

0    1978.0
Name: Birth_Year, dtype: float64

In [34]:
Customer_Demographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                    0
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                   0
Birth_Year                              87
dtype: int64

In [35]:
#Dropping the null values rows in the date of birth (DOB) colum
Customer_Demographic.dropna(subset = ['DOB'], axis = 0, inplace = True)

In [36]:
Customer_Demographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              121
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                              497
job_industry_category                    0
wealth_segment                           0
deceased_indicator                       0
default                                215
owns_car                                 0
tenure                                   0
Birth_Year                               0
dtype: int64

In [37]:
#Deleting the Default column
del(Customer_Demographic['default'])

### 2. Customer Address Dataset

In [38]:
Customer_Address.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [39]:
#check if there are missing data 
Customer_Address.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [40]:
#value_count of state address
Customer_Address.state.value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [41]:
#replace New South Wales with NSW
Customer_Address['state']= Customer_Address['state'].replace('New South Wales', 'NSW')

In [42]:
#replace Victoria with VIC
Customer_Address['state']= Customer_Address['state'].replace('Victoria', 'VIC')

In [43]:
Customer_Address.state.value_counts()

NSW    2140
VIC    1021
QLD     838
Name: state, dtype: int64

In [44]:
#value_count of Country
Customer_Address.country.value_counts()

Australia    3999
Name: country, dtype: int64

### 3. Transaction Data Dataset

In [45]:
#observe the first  5 rows
Transaction_data.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [46]:
#check shape of the dataframe
Transaction_data.shape

(20000, 13)

In [47]:
#checking if there is missing data
Transaction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [48]:
#statistical formation of the data
Transaction_data.describe(include = 'all')

C:\Users\User\AppData\Local\Temp\ipykernel_16832\3506690822.py:2: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  Transaction_data.describe(include = 'all')

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
count,20000.000000,20000.00000,20000.000000,20000,19640.000000,20000,19803,19803,19803,19803,20000.000000,19803.000000,19803.000000
unique,NaN,NaN,NaN,364,NaN,2,6,4,3,3,NaN,NaN,NaN
top,NaN,NaN,NaN,2017-02-14 00:00:00,NaN,Approved,Solex,Standard,medium,medium,NaN,NaN,NaN
freq,NaN,NaN,NaN,82,NaN,19821,4253,14176,13826,12990,NaN,NaN,NaN
first,NaN,NaN,NaN,2017-01-01 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last,NaN,NaN,NaN,2017-12-30 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,10000.500000,45.36465,1738.246050,NaN,0.500458,NaN,NaN,NaN,NaN,NaN,1107.829449,556.046951,38199.776549
std,5773.647028,30.75359,1011.951046,NaN,0.500013,NaN,NaN,NaN,NaN,NaN,582.825242,405.955660,2875.201110
min,1.000000,0.00000,1.000000,NaN,0.000000,NaN,NaN,NaN,NaN,NaN,12.010000,7.210000,33259.000000
25%,5000.750000,18.00000,857.750000,NaN,0.000000,NaN,NaN,NaN,NaN,NaN,575.270000,215.140000,35667.000000
50%,10000.500000,44.00000,1736.000000,NaN,1.000000,NaN,NaN,NaN,NaN,NaN,1163.890000,507.580000,38216.000000
75%,15000.250000,72.00000,2613.000000,NaN,1.000000,NaN,NaN,NaN,NaN,NaN,1635.300000,795.100000,40672.000000
max,20000.000000,100.00000,5034.000000,NaN,1.000000,NaN,NaN,NaN,NaN,NaN,2091.470000,1759.850000,42710.000000

In [49]:
#missing data summary
Transaction_data.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [50]:
Transaction_data.brand.value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [51]:
Transaction_data.order_status.value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [52]:
Transaction_data.online_order.value_counts()

1.0    9829
0.0    9811
Name: online_order, dtype: int64

#### Missing data
- Drop missing rows

In [53]:
#Dropping the missing data in the Brand column
Transaction_data.dropna(subset= ['brand'], axis = 0, inplace = True)

In [54]:
Transaction_data.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               358
order_status                 0
brand                        0
product_line                 0
product_class                0
product_size                 0
list_price                   0
standard_cost                0
product_first_sold_date      0
dtype: int64

In [55]:
!pip install xlsxwriter

Requirement already satisfied: xlsxwriter in c:\users\user\anaconda3\lib\site-packages (3.0.3)

In [56]:
#Exporting the dataset to excel
KPMG_dataset = pd.ExcelWriter('file_V2.xlsx', engine='xlsxwriter')

In [57]:
#Exporting the 3 datasets to excel
Customer_Demographic.to_excel(KPMG_dataset, sheet_name='Customer Demographic')
Customer_Address.to_excel(KPMG_dataset, sheet_name='Customer Address')
Transaction_data.to_excel(KPMG_dataset, sheet_name='Transaction Data')

In [58]:
KPMG_dataset.save( )